medicalopenworld/IncuNest/Firmware/motherBoard/test_apps/plat_fs_test/sdkconfig.defaults
# Test app de plat_fs. Mismo target y misma flash que la motherBoard, porque
# lo que se prueba es el sistema de ficheros REAL: montar LittleFS sobre la
# particion "spiffs" de la tabla de 8 MB (que monta LittleFS pese al nombre,
# ver partitions/ESP32S3_8MB.csv).
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# La motherBoard saca consola por UART0, igual que el firmware de produccion.
# No se cambia a USB-Serial-JTAG como en la SensorBoard: aqui TXD0/RXD0 si
# estan cableados y es por donde se lee el resultado de Unity.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# La misma tabla de particiones que la placa: sin ella no existe la particion
# "spiffs" y el test no tendria donde montar.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="../../partitions/ESP32S3_8MB.csv"

# ATENCION: este binario NO es el firmware de la incubadora. Mientras este
# flasheado, la placa no regula nada. Reflashear el firmware de produccion al
# terminar.
